# Fonts
cask "font-fira-code"

brew "zsh"
brew "starship"
brew "fzf"
brew "direnv"
brew "bat"
brew "entr"
brew "tlrc"
brew "zoxide"
brew "mise"
brew "colima"
brew "docker"
brew "docker-compose"
brew "ffmpeg"
brew "yt-dlp"
brew "just"

# specific emacs dependencies
brew "fd"
brew "rg"
brew "jq"
brew "pngpaste"
brew "coreutils"
tap "d12frosted/emacs-plus"
brew "emacs-plus@31", args: ["with-imagemagick", "with-xwidgets"]


cask "alfred"
cask "bitwarden"
cask "hammerspoon"
cask "ghostty"
cask "google-chrome"
cask "spotify"
cask "zulip"
cask "karabiner-elements"
cask "tailscale-app"
cask "resilio-sync"
cask "slack"
cask "netnewswire"
cask "cleanshot"
cask "claude"
cask "discord"
