tap "homebrew/cask" 

tap "homebrew/cask-fonts"
cask "font-fira-code"

brew "zsh"
brew "starship"
brew "fzf"
brew "direnv"
brew "bat"
brew "entr"
brew "tldr"
brew "zoxide"
brew "mise"

# specific emacs dependencies
brew "fd"
brew "rg"
brew "jq"
brew "coreutils"
tap "d12frosted/emacs-plus"
brew "emacs-plus", args: ["with-imagemagick", "with-native-comp", "with-modern-doom3-icon"]


cask "alfred"
cask "bitwarden"
cask "hammerspoon"
cask "iterm2"
cask "google-chrome"
cask "spotify"
cask "shortcat"
cask "zulip"
cask "karabiner-elements"
cask "tailscale"
cask "resilio-sync"
cask "slack"
cask "netnewswire"
cask "calibre"
cask "cleanshot"
cask "ghostty"

cask "bitwig-studio"
cask "darktable"
